Repository: openstack-archive/deb-magnum
Catalog: debian/po/*.po
Languages: pt

source: Set up a database for Magnum?
pt: Configurar uma base de dados para o Magnum?

source: * the type of database that you want to use; * the database server hostname (that server must allow TCP connections from this machine); * a username and password to access the database.
pt: * o tipo de base de dados que quer usar; * o nome do servidor (esse servidor deve aceitar ligações TCP a partir desta máquina); * o nome de utilizador e palavra passe para aceder à base de dados.

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
pt: Se algum destes requisitos estiver em falta, rejeite esta opção e execute com o suporte SQLite normal.

source: You can change this setting later on by running "dpkg-reconfigure -plow magnum-common".
pt: Pode mudar esta definição mais tarde ao executar "dpkg-reconfigure -plow magnum-common".

source: Authentication server hostname:
pt: Nome do servidor de autenticação:

source: Authentication server tenant name:
pt: Nome do 'tenant' do servidor de autenticação:

source: Please specify the authentication server tenant name.
pt: Indique, por favor, o nome do 'tenant' do servidor de autenticação.

source: Authentication server username:
pt: Nome de utilizador para o servidor de autenticação:

source: Please specify the username to use with the authentication server.
pt: Indique, por favor, o nome de utilizador para o servidor de autenticação.

source: Authentication server password:
pt: Palavra chave do servidor de autenticação:

source: Please specify the password to use with the authentication server.
pt: Indique, por favor, a palavra-chave para usar no servidor de autenticação.

source: IP address of your RabbitMQ host:
pt: Endereço IP do seu servidor RabbitMQ:

source: In order to interoperate with other components of OpenStack, this package needs to connect to a central RabbitMQ server.
pt: Para inter-operar com outros componentes do OpenStack, este pacote necessita de ligar-se a um servidor central RabbitMQ.

source: Please specify the IP address of that server.
pt: Indique, por favor, o endereço IP desse servidor.

source: Username for connection to the RabbitMQ server:
pt: Nome de utilizador para se ligar ao servidor RabbitMQ:

source: Please specify the username used to connect to the RabbitMQ server.
pt: Por favor, indique o nome de utilizador para se ligar ao servidor RabbitMQ.

source: Password for connection to the RabbitMQ server:
pt: Palavra-chave para a ligação ao servidor RabbitMQ:

source: Please specify the password used to connect to the RabbitMQ server.
pt: Indique, por favor, a palavra-passe usada para a ligação ao servidor RabbitMQ.

source: Register Magnum in the Keystone endpoint catalog?
pt: Registar o Magnum no catálogo de pontos finais do Keystone?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
pt: Cada serviço Openstack (cada API) deve estar registado para que seja acessível. Isto é feito com "keystone service-create" e "keystone endpoint-create". Pode correr estes comandos agora.

source: Keystone server IP address:
pt: Endereço IP do keystone:

source: Please enter the IP address of the Keystone server, so that magnum-api can contact Keystone to do the Magnum service and endpoint creation.
pt: Indique o endereço IP do seu servidor keystone, de modo a que o magnum-api possa contactar o Keystone para criar o serviço e ponto final Magnum.

source: Magnum endpoint IP address:
pt: Endereço IP do ponto final Magnum:

source: Please enter the IP address that will be used to contact Magnum.
pt: Indique o endereço IP que irá ser usado para contactar o Magnum.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
pt: Este endereço IP deve ser acessível a partir dos clientes que irão usar este serviço, portanto se está a instalar uma cloud pública, este deve ser um endereço IP público.

source: Name of the region to register:
pt: Nome da região a registar:

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
pt: O Openstack pode ser usado com zonas de disponibilidade, com cada região a representar uma localização. Por favor, indique a zona que quer usar ao registar um ponto final.
